Revit 2018 API
XYZ.Item Property
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Syntax
C#
public double this[
	int idx
] { get; }
Visual Basic
Public ReadOnly Default Property Item ( _
	idx As Integer _
) As Double
	Get
Visual C++
public:
property double default[int idx] {
	double get (int idx);
}
Parameters
idx
Type: System.Int32
See Also
XYZ Class
Autodesk.Revit.DB Namespace